[
  {
    "id": "1697245200223-0",
    "title": "Software Engineer",
    "description": "Develop and maintain software applications for a variety of industries.",
    "salary": "$80,000 - $120,000",
    "company": "TechCorp",
    "location": "San Francisco, USA",
    "qualifications": "Bachelor's degree in Computer Science, 3+ years of experience in software development, proficiency in JavaScript and Python.",
    "benefits": "Health insurance, 401(k) matching, remote work options.",
    "contactInfo": "hr@techcorp.com",
    "companyBackground": "TechCorp is a leading software development company specializing in innovative solutions.",
    "applicationProcedure": "Submit your resume and cover letter via email.",
    "responsibilities": "Write clean, scalable code, participate in code reviews, collaborate with cross-functional teams.",
    "roleSummary": "As a Software Engineer, you will design, develop, and test software applications.",
    "businessIntro": "TechCorp is dedicated to creating software that solves complex business problems.",
    "preferredQualifications": "Experience with cloud platforms, strong debugging skills, knowledge of REST APIs.",
    "applicationDirections": "Email your resume to hr@techcorp.com.",
    "internalAdvertising": "This position is also open for internal applications.",
    "socialMedia": "@TechCorpOfficial"
  },
  {
    "id": "1697245200223-1",
    "title": "Frontend Developer",
    "description": "Build and optimize user interfaces for our web applications.",
    "salary": "€60,000 - €80,000",
    "company": "WebGenics",
    "location": "Berlin, Germany",
    "qualifications": "Bachelor's in Computer Science, 2+ years of experience in frontend development, expertise in React and CSS.",
    "benefits": "Paid time off, health insurance, transportation stipend.",
    "contactInfo": "jobs@webgenics.de",
    "companyBackground": "WebGenics is a web development agency known for creating modern and responsive websites.",
    "applicationProcedure": "Complete the online application form on our website.",
    "responsibilities": "Design and implement UI components, optimize performance, collaborate with backend developers.",
    "roleSummary": "You will develop visually appealing web applications and ensure they are optimized for maximum performance.",
    "businessIntro": "WebGenics specializes in building dynamic websites for clients across Europe.",
    "preferredQualifications": "Familiarity with TypeScript, experience with testing frameworks like Jest.",
    "applicationDirections": "Apply through our website under the careers section.",
    "internalAdvertising": "We encourage our current employees to apply for this role.",
    "socialMedia": "@WebGenics"
  },
  {
    "id": "1697245200223-2",
    "title": "Backend Developer",
    "description": "Build and maintain the server-side logic and databases for web applications.",
    "salary": "$75,000 - $100,000",
    "company": "DevSolutions",
    "location": "Toronto, Canada",
    "qualifications": "3+ years of experience with Node.js, Express, and SQL databases.",
    "benefits": "Flexible working hours, health insurance, learning and development opportunities.",
    "contactInfo": "careers@devsolutions.ca",
    "companyBackground": "DevSolutions is a fast-growing software company focused on backend solutions for enterprises.",
    "applicationProcedure": "Email your resume and project portfolio.",
    "responsibilities": "Design API endpoints, ensure data security, collaborate with frontend teams.",
    "roleSummary": "As a Backend Developer, you will focus on building and maintaining scalable server-side architecture.",
    "businessIntro": "At DevSolutions, we provide cutting-edge backend solutions for our global clients.",
    "preferredQualifications": "Experience with NoSQL databases and microservices architecture.",
    "applicationDirections": "Submit your portfolio along with the resume via email.",
    "internalAdvertising": "Current employees are welcome to apply internally.",
    "socialMedia": "@DevSolutionsTech"
  },
  {
    "id": "1697245200223-3",
    "title": "Cloud Engineer",
    "description": "Design, implement, and manage cloud infrastructure solutions.",
    "salary": "£70,000 - £90,000",
    "company": "CloudSphere",
    "location": "London, UK",
    "qualifications": "Experience with AWS or Azure, proficiency in Terraform and Kubernetes.",
    "benefits": "Pension plan, health insurance, remote work flexibility.",
    "contactInfo": "hr@cloudsphere.uk",
    "companyBackground": "CloudSphere is a cloud consulting firm specializing in scalable cloud solutions.",
    "applicationProcedure": "Apply on our website by uploading your resume and cover letter.",
    "responsibilities": "Manage cloud environments, monitor performance, ensure security and compliance.",
    "roleSummary": "You will work on deploying and managing cloud infrastructure to support various client applications.",
    "businessIntro": "CloudSphere delivers cutting-edge cloud services to businesses around the world.",
    "preferredQualifications": "Certifications in AWS or Azure, knowledge of DevOps practices.",
    "applicationDirections": "Complete the online application form on our website.",
    "internalAdvertising": "We support internal career growth and encourage current employees to apply.",
    "socialMedia": "@CloudSphere"
  },
  {
    "id": "1697245200223-4",
    "title": "Frontend Engineer",
    "description": "Create responsive and user-friendly interfaces for web applications.",
    "salary": "$70,000 - $90,000",
    "company": "InnoTech",
    "location": "Nairobi, Kenya",
    "qualifications": "Proficiency in JavaScript, CSS, and React, 2+ years of experience.",
    "benefits": "Health insurance, remote work options, gym membership.",
    "contactInfo": "jobs@innotech.co.ke",
    "companyBackground": "InnoTech is a Nairobi-based startup focused on developing innovative web platforms.",
    "applicationProcedure": "Submit your resume and GitHub portfolio.",
    "responsibilities": "Develop front-end features, optimize performance, collaborate with design teams.",
    "roleSummary": "You will be responsible for the development and implementation of the user interface.",
    "businessIntro": "InnoTech is committed to building the next generation of web applications.",
    "preferredQualifications": "Experience with mobile-first design, knowledge of Vue.js.",
    "applicationDirections": "Send your portfolio link and resume to our HR department.",
    "internalAdvertising": "Internal candidates are encouraged to apply.",
    "socialMedia": "@InnoTechKenya"
  },
  {
    "id": "1697245200223-5",
    "title": "Backend Engineer",
    "description": "Develop and maintain backend systems for enterprise applications.",
    "salary": "KES 1,500,000 - KES 2,000,000 annually",
    "company": "NexTech",
    "location": "Mombasa, Kenya",
    "qualifications": "Strong experience with Python and Django, 4+ years in backend development.",
    "benefits": "Health insurance, performance bonuses, travel allowances.",
    "contactInfo": "careers@nextech.co.ke",
    "companyBackground": "NexTech is a leading technology company in Kenya focused on delivering enterprise solutions.",
    "applicationProcedure": "Send your CV and project links to careers@nextech.co.ke.",
    "responsibilities": "Design RESTful APIs, integrate third-party services, optimize database performance.",
    "roleSummary": "As a Backend Engineer, you will manage server-side logic and ensure high performance of our applications.",
    "businessIntro": "NexTech is shaping the future of technology in Africa with cutting-edge enterprise solutions.",
    "preferredQualifications": "Experience with cloud services (AWS, GCP), knowledge of microservices architecture.",
    "applicationDirections": "Email your CV and a brief cover letter explaining your experience.",
    "internalAdvertising": "We are open to internal applications for this role.",
    "socialMedia": "@NexTechAfrica"
  },
  {
    "id": "1697245200223-6",
    "title": "Cloud Solutions Architect",
    "description": "Design and deploy cloud infrastructure solutions for enterprise clients.",
    "salary": "€90,000 - €120,000",
    "company": "CloudMasters",
    "location": "Paris, France",
    "qualifications": "5+ years of experience with cloud platforms (AWS, GCP), strong architecture skills.",
    "benefits": "Health insurance, pension plan, remote work flexibility.",
    "contactInfo": "recruitment@cloudmasters.fr",
    "companyBackground": "CloudMasters is a cloud services company providing architecture and deployment solutions.",
    "applicationProcedure": "Submit your application online via our careers portal.",
    "responsibilities": "Architect cloud solutions, collaborate with clients to understand requirements, ensure scalability.",
    "roleSummary": "You will design cloud architectures that meet client requirements for performance and scalability.",
    "businessIntro": "CloudMasters is a leader in cloud transformation services for enterprise clients across Europe.",
    "preferredQualifications": "Cloud certifications (AWS Solutions Architect), knowledge of CI/CD pipelines.",
    "applicationDirections": "Complete the application form and attach your resume.",
    "internalAdvertising": "This position is open for internal candidates as well.",
    "socialMedia": "@CloudMastersFR"
  },
  {
    "id": "1697245200223-7",
    "title": "Mobile App Developer",
    "description": "Develop and maintain mobile applications for iOS and Android platforms.",
    "salary": "$80,000 - $110,000",
    "company": "AppCreators",
    "location": "Austin, USA",
    "qualifications": "2+ years of experience in mobile app development, proficiency in Swift and Kotlin.",
    "benefits": "Flexible hours, health insurance, remote work options.",
    "contactInfo": "jobs@appcreators.com",
    "companyBackground": "AppCreators specializes in building innovative mobile applications for startups.",
    "applicationProcedure": "Send your resume and links to apps you've developed.",
    "responsibilities": "Design and develop mobile applications, collaborate with UX/UI designers.",
    "roleSummary": "As a Mobile App Developer, you will create high-quality mobile applications.",
    "businessIntro": "AppCreators is committed to delivering user-friendly and efficient mobile solutions.",
    "preferredQualifications": "Experience with React Native, knowledge of mobile app analytics.",
    "applicationDirections": "Apply by emailing your resume and portfolio.",
    "internalAdvertising": "Current employees are encouraged to apply internally.",
    "socialMedia": "@AppCreators"
  },
  
]